PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/devices/include/ip/cyip_gpio.h
#define GPIO_PRT_CFG_OUT2_DS_TRIM0_Msk          0x7UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM1_Pos          3UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM1_Msk          0x38UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM2_Pos          6UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM2_Msk          0x1C0UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM3_Pos          9UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM3_Msk          0xE00UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM4_Pos          12UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM4_Msk          0x7000UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM5_Pos          15UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM5_Msk          0x38000UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM6_Pos          18UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM6_Msk          0x1C0000UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM7_Pos          21UL
#define GPIO_PRT_CFG_OUT2_DS_TRIM7_Msk          0xE00000UL
/* GPIO_PRT.CFG_SLEW_EXT */
#define GPIO_PRT_CFG_SLEW_EXT_SLEW0_Pos         0UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW0_Msk         0x7UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW1_Pos         4UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW1_Msk         0x70UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW2_Pos         8UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW2_Msk         0x700UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW3_Pos         12UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW3_Msk         0x7000UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW4_Pos         16UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW4_Msk         0x70000UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW5_Pos         20UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW5_Msk         0x700000UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW6_Pos         24UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW6_Msk         0x7000000UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW7_Pos         28UL
#define GPIO_PRT_CFG_SLEW_EXT_SLEW7_Msk         0x70000000UL
/* GPIO_PRT.CFG_DRIVE_EXT0 */
#define GPIO_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT0_Pos 0UL
#define GPIO_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT0_Msk 0x1FUL
#define GPIO_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT1_Pos 8UL
#define GPIO_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT1_Msk 0x1F00UL
#define GPIO_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT2_Pos 16UL
#define GPIO_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT2_Msk 0x1F0000UL
#define GPIO_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT3_Pos 24UL
#define GPIO_PRT_CFG_DRIVE_EXT0_DRIVE_SEL_EXT3_Msk 0x1F000000UL
/* GPIO_PRT.CFG_DRIVE_EXT1 */
#define GPIO_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT4_Pos 0UL
#define GPIO_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT4_Msk 0x1FUL
#define GPIO_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT5_Pos 8UL
#define GPIO_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT5_Msk 0x1F00UL
#define GPIO_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT6_Pos 16UL
#define GPIO_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT6_Msk 0x1F0000UL
#define GPIO_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT7_Pos 24UL
#define GPIO_PRT_CFG_DRIVE_EXT1_DRIVE_SEL_EXT7_Msk 0x1F000000UL
/* GPIO_PRT.CFG_OUT3 */
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT0_Pos    0UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT0_Msk    0xFUL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT1_Pos    4UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT1_Msk    0xF0UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT2_Pos    8UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT2_Msk    0xF00UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT3_Pos    12UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT3_Msk    0xF000UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT4_Pos    16UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT4_Msk    0xF0000UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT5_Pos    20UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT5_Msk    0xF00000UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT6_Pos    24UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT6_Msk    0xF000000UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT7_Pos    28UL
#define GPIO_PRT_CFG_OUT3_DRIVEMODE_EXT7_Msk    0xF0000000UL
/* GPIO_PRT.CFG_RES */
#define GPIO_PRT_CFG_RES_RESISTOR_CFG0_Pos      0UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG0_Msk      0xFUL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG1_Pos      4UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG1_Msk      0xF0UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG2_Pos      8UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG2_Msk      0xF00UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG3_Pos      12UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG3_Msk      0xF000UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG4_Pos      16UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG4_Msk      0xF0000UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG5_Pos      20UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG5_Msk      0xF00000UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG6_Pos      24UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG6_Msk      0xF000000UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG7_Pos      28UL
#define GPIO_PRT_CFG_RES_RESISTOR_CFG7_Msk      0xF0000000UL
/* GPIO_PRT.MSC_ANA */
#define GPIO_PRT_MSC_ANA_DATA0_Pos              0UL
#define GPIO_PRT_MSC_ANA_DATA0_Msk              0x1UL
#define GPIO_PRT_MSC_ANA_DATA1_Pos              1UL
#define GPIO_PRT_MSC_ANA_DATA1_Msk              0x2UL
#define GPIO_PRT_MSC_ANA_DATA2_Pos              2UL
#define GPIO_PRT_MSC_ANA_DATA2_Msk              0x4UL
#define GPIO_PRT_MSC_ANA_DATA3_Pos              3UL
#define GPIO_PRT_MSC_ANA_DATA3_Msk              0x8UL
#define GPIO_PRT_MSC_ANA_DATA4_Pos              4UL
#define GPIO_PRT_MSC_ANA_DATA4_Msk              0x10UL
#define GPIO_PRT_MSC_ANA_DATA5_Pos              5UL
#define GPIO_PRT_MSC_ANA_DATA5_Msk              0x20UL
#define GPIO_PRT_MSC_ANA_DATA6_Pos              6UL
#define GPIO_PRT_MSC_ANA_DATA6_Msk              0x40UL
#define GPIO_PRT_MSC_ANA_DATA7_Pos              7UL
#define GPIO_PRT_MSC_ANA_DATA7_Msk              0x80UL


/* GPIO.SEC_INTR_CAUSE0 */
#define GPIO_SEC_INTR_CAUSE0_PORT_INT_Pos       0UL
#define GPIO_SEC_INTR_CAUSE0_PORT_INT_Msk       0xFFFFFFFFUL
/* GPIO.SEC_INTR_CAUSE1 */
#define GPIO_SEC_INTR_CAUSE1_PORT_INT_Pos       0UL
#define GPIO_SEC_INTR_CAUSE1_PORT_INT_Msk       0xFFFFFFFFUL
/* GPIO.SEC_INTR_CAUSE2 */
#define GPIO_SEC_INTR_CAUSE2_PORT_INT_Pos       0UL
#define GPIO_SEC_INTR_CAUSE2_PORT_INT_Msk       0xFFFFFFFFUL
/* GPIO.SEC_INTR_CAUSE3 */
#define GPIO_SEC_INTR_CAUSE3_PORT_INT_Pos       0UL
#define GPIO_SEC_INTR_CAUSE3_PORT_INT_Msk       0xFFFFFFFFUL
/* GPIO.INTR_CAUSE0 */
#define GPIO_INTR_CAUSE0_PORT_INT_Pos           0UL
#define GPIO_INTR_CAUSE0_PORT_INT_Msk           0xFFFFFFFFUL
/* GPIO.INTR_CAUSE1 */
#define GPIO_INTR_CAUSE1_PORT_INT_Pos           0UL
#define GPIO_INTR_CAUSE1_PORT_INT_Msk           0xFFFFFFFFUL
/* GPIO.INTR_CAUSE2 */
#define GPIO_INTR_CAUSE2_PORT_INT_Pos           0UL
#define GPIO_INTR_CAUSE2_PORT_INT_Msk           0xFFFFFFFFUL
/* GPIO.INTR_CAUSE3 */
#define GPIO_INTR_CAUSE3_PORT_INT_Pos           0UL
#define GPIO_INTR_CAUSE3_PORT_INT_Msk           0xFFFFFFFFUL
/* GPIO.VDD_ACTIVE */
#define GPIO_VDD_ACTIVE_VDDIO_ACTIVE_Pos        0UL
#define GPIO_VDD_ACTIVE_VDDIO_ACTIVE_Msk        0xFFFFUL
#define GPIO_VDD_ACTIVE_VDDA_ACTIVE_Pos         30UL
#define GPIO_VDD_ACTIVE_VDDA_ACTIVE_Msk         0x40000000UL
#define GPIO_VDD_ACTIVE_VDDD_ACTIVE_Pos         31UL
#define GPIO_VDD_ACTIVE_VDDD_ACTIVE_Msk         0x80000000UL
/* GPIO.VDD_INTR */
#define GPIO_VDD_INTR_VDDIO_ACTIVE_Pos          0UL
#define GPIO_VDD_INTR_VDDIO_ACTIVE_Msk          0xFFFFUL
#define GPIO_VDD_INTR_VDDA_ACTIVE_Pos           30UL
#define GPIO_VDD_INTR_VDDA_ACTIVE_Msk           0x40000000UL
#define GPIO_VDD_INTR_VDDD_ACTIVE_Pos           31UL
#define GPIO_VDD_INTR_VDDD_ACTIVE_Msk           0x80000000UL
/* GPIO.VDD_INTR_MASK */
#define GPIO_VDD_INTR_MASK_VDDIO_ACTIVE_Pos     0UL
#define GPIO_VDD_INTR_MASK_VDDIO_ACTIVE_Msk     0xFFFFUL
#define GPIO_VDD_INTR_MASK_VDDA_ACTIVE_Pos      30UL
#define GPIO_VDD_INTR_MASK_VDDA_ACTIVE_Msk      0x40000000UL
#define GPIO_VDD_INTR_MASK_VDDD_ACTIVE_Pos      31UL
#define GPIO_VDD_INTR_MASK_VDDD_ACTIVE_Msk      0x80000000UL
/* GPIO.VDD_INTR_MASKED */
#define GPIO_VDD_INTR_MASKED_VDDIO_ACTIVE_Pos   0UL
#define GPIO_VDD_INTR_MASKED_VDDIO_ACTIVE_Msk   0xFFFFUL
#define GPIO_VDD_INTR_MASKED_VDDA_ACTIVE_Pos    30UL
#define GPIO_VDD_INTR_MASKED_VDDA_ACTIVE_Msk    0x40000000UL
#define GPIO_VDD_INTR_MASKED_VDDD_ACTIVE_Pos    31UL
#define GPIO_VDD_INTR_MASKED_VDDD_ACTIVE_Msk    0x80000000UL
/* GPIO.VDD_INTR_SET */
#define GPIO_VDD_INTR_SET_VDDIO_ACTIVE_Pos      0UL
#define GPIO_VDD_INTR_SET_VDDIO_ACTIVE_Msk      0xFFFFUL
#define GPIO_VDD_INTR_SET_VDDA_ACTIVE_Pos       30UL
#define GPIO_VDD_INTR_SET_VDDA_ACTIVE_Msk       0x40000000UL
#define GPIO_VDD_INTR_SET_VDDD_ACTIVE_Pos       31UL
#define GPIO_VDD_INTR_SET_VDDD_ACTIVE_Msk       0x80000000UL
/* GPIO.VDD_MODE_SEL */
#define GPIO_VDD_MODE_SEL_MODE_SEL_Pos          0UL
#define GPIO_VDD_MODE_SEL_MODE_SEL_Msk          0xFFFFUL


#endif /* _CYIP_GPIO_H_ */


/* [] END OF FILE */
